alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F094_RSQ_check_0_a.c
/*----------------------------------------------------------------------------
*
* The confidential and proprietary information contained in this file may
* only be used by a person authorised under and to the extent permitted
* by a subsisting licensing agreement from ARM Limited.
*
*        (C) COPYRIGHT 2008-2009 ARM Limited.
*             ALL RIGHTS RESERVED
*             
* This entire notice must be reproduced on all copies of this file
* and copies of this file may only be made by a person if such person is
* permitted to do so under the terms of a subsisting license agreement
* from ARM Limited.
*
* Modified  : $Date: 2013/05/14 11:57:51 $
* Revision  : $Revision: 1.1 $
* Release   : $State: Exp $
*-----------------------------------------------------------------------------*/
#include "m400_gp_F094_RSQ_check_0_a.h"
struct t_CheckData_m400_gp_F094_RSQ_check_0_a __attribute__ ((section(".mali_data_check"))) CheckData_m400_gp_F094_RSQ_check_0_a = {
/* unsigned int data_00002000[] = */
{
 0x3f7c175f,0x3f785b3c,0x3f74c864,0x3f715bee /* 00002000 */
,0x3f6e1339,0x3f6aebf1,0x3f67e3ea,0x3f64f92d /* 00002010 */
,0x3f6229ea,0x3f5f7480,0x3f5cd76c,0x3f5a5148 /* 00002020 */
,0x3f57e0ce,0x3f5584ce,0x3f533c2d,0x3f5105ec /* 00002030 */
,0x3f4ee115,0x3f4ccccd,0x3f4ac840,0x3f48d2ac /* 00002040 */
,0x3f46eb5a,0x3f4511a4,0x3f4344e6,0x3f418490 /* 00002050 */
,0x3f3fd013,0x3f3e26ec,0x3f3c889f,0x3f3af4ba /* 00002060 */
,0x3f396ace,0x3f37ea74,0x3f367348,0x3f3504f0 /* 00002070 */
,0x3f324165,0x3f2f9d4e,0x3f2d166b,0x3f2aaaa8 /* 00002080 */
,0x3f285833,0x3f261d5f,0x3f23f8a2,0x3f21e899 /* 00002090 */
,0x3f1fec00,0x3f1e01b3,0x3f1c2894,0x3f1a5fb2 /* 000020a0 */
,0x3f18a620,0x3f16fb08,0x3f155da1,0x3f13cd3c /* 000020b0 */
,0x3f124923,0x3f10d0c2,0x3f0f6383,0x3f0e00d7 /* 000020c0 */
,0x3f0ca83e,0x3f0b594a,0x3f0a137f,0x3f08d679 /* 000020d0 */
,0x3f07a1d2,0x3f067534,0x3f05503f,0x3f0432a6 /* 000020e0 */
,0x3f031c1b,0x3f020c53,0x3f01030d,0x3efffffc /* 000020f0 */
},
};

